/*
ВСЕ ЗРОБИТИ СТРІЛОЧНИМИ ФУНКЦІЯМИ!
- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
*/
let areaRectangle = (a,b) => a*b;
console.log(areaRectangle(10,5));
/*
- створити функцію яка обчислює та повертає площу кола з радіусом r
*/
let areaCirvle = (r) => 3.14 * Math.pow(r, 2);
console.log(areaCirvle(5)); //S = π r2 = π 52 = 25 π (м)2 ≈ 78.5 (м)2
/*
- створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
*/
let countCylinder = (r, h) => 2 * 3.14 * r * (r + h); //S = 2 π R (R + h)
console.log(countCylinder(5,11));
/*
- створити функцію яка приймає масив та виводить кожен його елемент
*/
let getItemFromArr = (arr) => {
    for (const arrElement of arr) {
        console.log(arrElement);
    }
}
getItemFromArr([1,22,false,'ggg']);
/*
- створити функцію яка створює параграф з текстом. Текст задати через аргумент
*/
let makeTagP = (text) => `<p>${text}</p>`;
console.log(makeTagP('Okten'));
/*
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
*/

/*
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
- створити функцію яка повертає найменьше число з масиву
- створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
- створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
- Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250
*/